In [1]:
import pandas as pd

In [2]:
data = {"customer_id":[1,2,3,4,5,6],
        "name":['Ella', 'David', 'Zachary', 'Alice', 'Finn', 'Violet'],
        "email":['emily@example.com',
                 'michael@example.com',
                 'sarah@example.com',
                 'john@example.com',
                 'john@example.com',
                 'alice@example.com']}
df = pd.DataFrame(data)

需要去除重复的行内容（email列中有重复）,并保留第一个出现的行内容

In [3]:
df.drop_duplicates('email')

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

_____

In [4]:
data = {"student_id":[32, 217, 779, 849],
        "name":['Piper', None, 'Georgia', 'Willow'],
        "age":[5, 19, 20, 14]}
df = pd.DataFrame(data)

去除掉'name'列中的空值

In [5]:
df.dropna(subset='name')

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14

_____

In [6]:
data = {"name":['Wristwatch', 'WirelessEarbuds', 'GolfClubs', 'Printer'],
        "quantity":[None, None, 779, 849],
        "price":[135, 821, 9319, 3051]}
df = pd.DataFrame(data)

将'quantity'中的空值设为0

In [7]:
df['quantity'].fillna(0, inplace=True)

In [8]:
df

              name  quantity  price
0       Wristwatch       0.0    135
1  WirelessEarbuds       0.0    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051

___

In [9]:
data1 = {'student_id':[1,2,3,4],
         'name':['Mason', 'Ava', 'Taylor', 'Georgia'],
         'age':[8, 6, 15, 17]}
data2 = {'student_id':[5,6],
         'name':['Leo', 'Alex'],
         'age':[7, 7]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

将df1和df2垂直合并（默认）

In [10]:
# ignore_index=True的作用是忽略索引，重新生成连续索引
pd.concat([df1, df2], ignore_index=True)

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
4           5      Leo    7
5           6     Alex    7

___

In [11]:
data = {'city':['Jacksonville', 'Jacksonville', 'Jacksonville',
                'Jacksonville', 'Jacksonville', 'ElPaso',
                'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso'],
        'month':['January', 'February', 'March', 'April', 'May',
                 'January', 'February', 'March', 'April', 'May'],
        'temperature':[13, 23, 38, 5, 34, 20, 6, 26, 2, 43]}
df = pd.DataFrame(data)

制作数据透视表，根据月份显示两个城市的温度

In [12]:
df.pivot(index='month', columns='city', values='temperature').sort_index()

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34

在使用数据透视表pivot()功能时，需要明确三个参数：index-用什么当作索引，columns-用什么当作列名，values-用什么来当作表格中的值

___

In [13]:
data = {'product':['Umbrella', 'SleepingBag'],
        'quarter_1':[417, 800],
        'quarter_2':[224, 936],
        'quarter_3':[379, 93],
        'quarter_4':[611, 875]}
df = pd.DataFrame(data)
df

       product  quarter_1  quarter_2  quarter_3  quarter_4
0     Umbrella        417        224        379        611
1  SleepingBag        800        936         93        875

将df中的数据（按季度横向排列）改为按产品名称（纵向排列）

In [14]:
df = df.melt(
        id_vars=['product'],
        value_vars=['quarter_1', 'quarter_2', 'quarter_3', 'quarter_4'],
        var_name='quarter',
        value_name='sales'
    )
df

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

melt()功能用来改变数据的形状，其中有四个参数：id_vars, value_vars, var_name, value_name。

id_vars - 在处理过程中，哪些列需要保持不变（product）

value_vars - 哪些列需要被melt来改变形状（各个quarter）

var_name - 新的列名称，改列用来存储value_vars的头部名称（quarter）

value_name - 新的列名称，该列用来存储value_vars的内容（sales）

___

In [15]:
data = {"name":['Tatiana', 'Khaled', 'Alex', 'Jonathan', 'Stefan', 'Tommy'],
        "species":['Snake', 'Giraffe', 'Leopard', 'Monkey', 'Bear', 'Panda'],
        "age":[98, 50, 6, 45, 100, 26],
        "weight":[464, 41, 328, 463, 50, 349]}
df = pd.DataFrame(data)

In [16]:
df.head()

       name  species  age  weight
0   Tatiana    Snake   98     464
1    Khaled  Giraffe   50      41
2      Alex  Leopard    6     328
3  Jonathan   Monkey   45     463
4    Stefan     Bear  100      50

In [17]:
df.loc[df['weight']>100, 'name'].sort_values(by='weight', ascending=False)

TypeError: Series.sort_values() got an unexpected keyword argument 'by'

由于.sort_values()方法需要对DataFrame操作，而使用loc[]方法选择单列数据时的数据格式不对。同时，如果把代码改成下面👇，又会出现新的问题：

In [18]:
df.loc[df['weight']>100, ['name']].sort_values(by='weight', ascending=False)

KeyError: 'weight'

由于排序过程中，需要使用到'weight'的值，而在loc[]中并没有选择显示'weight'列，故出现问题。正确的做法如下👇

In [19]:
df[df['weight']>100].sort_values(by='weight', ascending=False)[['name']]

       name
0   Tatiana
3  Jonathan
5     Tommy
2      Alex